skillfair/app/controllers/products_controller.rb

INSERT INTO "products" ("label", "image_url", "created_at", "updated_at") VALUES ('candy bar', 'https://images.getrecipekit.com/20230626215711-candybarssquares.png?aspect_ratio=16:9&quality=90&', '2025-05-22 21:19:50.783954', '2025-05-22 21:19:50.783954') RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 5 LIMIT 1
---
    def set_product
      @product = Product.find(params.expect(:id))